export const nuclearLocations = [
  {
    name: "고리원전",
    x: 129.28595,
    y: 35.32991,
  },
  {
    name: "새울원전",
    x: 129.30873,
    y: 35.33384,
  },
  {
    name: "월성원전",
    x: 129.47574,
    y: 35.71601,
  },
  {
    name: "한울원전",
    x: 129.38261,
    y: 37.092648,
  },
  {
    name: "한빛원전",
    x: 126.416245,
    y: 35.4112,
  },
  {
    name: "대전원전",
    x: 127.3717,
    y: 36.4257,
  }
]

export const chemistryLocations = [
  {
    name: "태광산업(주) 석유화학3공장",
    x: 129.33775,
    y: 35.502983,
  },
  {
    name: "금호석유화학(주) 울산고무공장",
    x: 129.32312,
    y: 35.48984,
  },
  {
    name: "SK에너지(주) 본공장",
    x: 129.3568,
    y: 35.504223,
  },
  {
    name: "대한유화(주) 온산공장",
    x: 129.33931,
    y: 35.456894,
  },
  {
    name: "한국바스프(주) 여수공장",
    x: 127.649826,
    y: 34.82321,
  },
  {
    name: "금호미쓰이화학(주)",
    x: 127.64733,
    y: 34.817554,
  },
  {
    name: "고리원전",
    x: 129.28595,
    y: 35.32991,
  },
  {
    name: "한화솔루션(주) 티디아이",
    x: 127.65703,
    y: 34.807777,
  },
  {
    name: "롯데케미칼㈜ 대산공장",
    x: 126.3702,
    y: 36.997883,
  },
  {
    name: "현대오일뱅크",
    x: 126.40084,
    y: 37.0078,
  }
]

export const stormLocations = [
  {
    name: "양양 기사운리 마을회관",
    x: 128.73108,
    y: 38.008682,
  },
  {
    name: "목포시",
    x: 126.39544,
    y: 34.79337,
  },
  {
    name: "속초 대포항",
    x: 128.60811,
    y: 38.172913,
  },
  {
    name: "서천군",
    x: 126.69463,
    y: 36.015915,
  }
]

export const floodLocations = [
  {
    name: "울진군",
    x: 129.44225,
    y: 36.678787,
  },
  {
    name: "구례군",
    x: 127.48194,
    y: 35.200253,
  },
  {
    name: "안동시",
    x: 128.75804,
    y: 36.55456,
  },
  {
    name: "나주시",
    x: 126.708725,
    y: 34.9996,
  },
  {
    name: "예천군",
    x: 128.44865,
    y: 36.65339,
  },
  {
    name: "삼척시",
    x: 129.17467,
    y: 37.437256,
  }
]

export const locationsByDisaster = {
  nuclear: nuclearLocations,
  chemistry: chemistryLocations,
  storm: stormLocations,
  flood: floodLocations
}